[
  {
    "courseName": {
      "name": "Kiến Thức Nhập Môn IT ",
      "date": "2023-10-15",
      "level": "Basic",
      "video": 4,
      "reading": 2,
      "time": "2 hours",
      "content": "Ở 4 chương mở đầu này, JOBA sẽ cung cấp cho bạn những thông tin tổng quan nhất về ngành IT nói chung và lập trình web nói riêng  "
    },
    "tutorial": [
      {
        "session": "1. Khái niệm kỹ thuật",
        "tutorialName": " Mô Hình Client - Server",
        "time": "10 mins",
        "video": {
          "url": "https://www.youtube.com/embed/zoELAirXMJY?si=QvXxrBf7lI54LPD4",
          "date": "2023-10-20",
          "description": "là mô hình mạng máy tính trong đó các máy tính con được đóng vai trò như một máy khách, chúng làm nhiệm vụ gửi yêu cầu đến các máy chủ. Để máy chủ xử lý yêu cầu và trả kết quả về cho máy khách đó.",
          "operation": " server chấp nhận tất cả các yêu cầu hợp lệ từ mọi nơi khác nhau trên Internet, sau đó trả kết quả về máy tính đã gửi yêu cầu đó. Máy tính được coi là máy khách khi chúng làm nhiệm vụ gửi yêu cầu đến các máy chủ và đợi câu trả lời được gửi về.  Để máy khách và máy chủ có thể giao tiếp được với nhau thì giữa chúng phải có một chuẩn nhất định, và chuẩn đó được gọi là giao thức.    Một số giao thức được sử dụng phổ biến hiện nay như: HTTPS, TCP/IP, FTP,...     ",
          "advantage": "Giúp chúng ta có thể làm việc trên bất kì một máy tính nào có hỗ trợ giao thức truyền thông.",
          "advantage1": "Có thể có nhiều server cùng làm một dịch vụ",
          "advantage2": "Hỗ trợ người dùng nhiều dịch vụ đa dạng và sự tiện dụng",
          "advantage3": "Cung cấp một nền tảng lý tưởng, cho phép cung cấp tích hợp các kỹ thuật hiện đại như mô hình thiết kế hướng đối tượng",
          "disadvantage": "Vấn đề bảo mật dữ liệu thông tin đôi khi còn chưa được an toàn lắm. "
        }
      },
      {
        "tutorialName": "Domain - tên miền",
        "time": "12 mins",
        "video": {
          "url": "https://www.youtube.com/embed/M62l1xA5Eu8?si=8kfwDUNTEGn7fcZx" ,
          "date": "2023-10-21",
          "description": "Mục đích chính của tên miền là để cung cấp một hình thức đại diện, hay nói cách khác, dùng những tên dễ nhận biết, thay cho những tài nguyên Internet mà đa số được đánh địa chỉ bằng số.",
          "operation": " sddddddddderver chấp nhận tất cả các yêu cầu hợp lệ từ mọi nơi khác nhau trên Internet, sau đó trả kết quả về máy tính đã gửi yêu cầu đó. Máy tính được coi là máy khách khi chúng làm nhiệm vụ gửi yêu cầu đến các máy chủ và đợi câu trả lời được gửi về.  Để máy khách và máy chủ có thể giao tiếp được với nhau thì giữa chúng phải có một chuẩn nhất định, và chuẩn đó được gọi là giao thức.    Một số giao thức được sử dụng phổ biến hiện nay như: HTTPS, TCP/IP, FTP,...     ",
          "advantage": "Giúp chúng ta có thể làm việc trên bất kì một máy tính nào có hỗ trợ giao thức truyền thông.",
          "advantage1": "Có thể có nhiều server cùng làm một dịch vụ",
          "advantage2": "Hỗ trợ người dùng nhiều dịch vụ đa dạng và sự tiện dụng",
          "advantage3": "Cung cấp một nền tảng lý tưởng, cho phép cung cấp tích hợp các kỹ thuật hiện đại như mô hình thiết kế hướng đối tượng",
          "disadvantage": "Vấn đề bảo mật dữ liệu thông tin đôi khi còn chưa được an toàn lắm. "
        }
      },
      {
        "session": "2. Môi trường, con người IT",
        "time": "1 hour",
        "tutorialName": "Những điều cần biết về IT",
        "video": {
          "url": "https://www.youtube.com/embed/CyZ_O7v62h4?si=Maj3BI66zXjAwsdn",
          "date": "2023-10-21",
          "description": "Description for Tutorial 2."
        }
      },
      {
        "tutorialName": "Học IT cần tố chất gì?",
        "time": "25 mins",

        "video": {
          "url": "https://www.youtube.com/embed/CyZ_O7v62h4?si=Maj3BI66zXjAwsdn",
          "date": "2023-10-21",
          "description": "Description for Tutorial 3."
        }
      },
      {
        "session": "3. Định hướng tương lai",
        "time": "25 mins",
        "tutorialName": "Làm sao để có thu nhập cao",

        "video": {
          "url": "https://www.youtube.com/embed/oF7isq9IjZM?si=XInc7DA7KP5JGLiO",
          "date": "2023-10-21",
          "description": "Tuong lai."
        }
      },
      {
        "tutorialName": "Học IT xong ra làm gì? ",
        "time": "1 hour",
        "video": {
          "url": "https://www.youtube.com/embed/zoELAirXMJY?si=TecWOpgoy9yO1zKU",
          "date": "2023-10-21",
          "description": "Description for Tutorial 2."
        }
      },
      {
        "session": "4. Thực tập ứng tuyển",
        "time": "35 mins",
        "tutorialName": "Sinh viên thực tập, ứng tuyển          ",
        "video": {
          "url": "https://www.youtube.com/embed/YH-E4Y3EaT4?si=vJav7olIGRRjy-Xx",
          "date": "2023-10-21",
          "description": "Sv"
        }
      },
      {
        "tutorialName": "Ứng tuyển, xin việc làm",
        "time": "1 hour",
        "video": {
          "url": "https://youtu.be/M62l1xA5Eu8?si=9fOpI_SQwTj7vzja",
          "date": "2023-10-21",
          "description": "Description for Tutorial 2."
        }
      }
    ],
    "access": "120.312k",
    "trailer": "https://files.fullstack.edu.vn/f8-prod/courses/7.png"
  },

  {
    "courseName": {
      "name": "Web Responsive with Grid System ",
      "date": "2023-10-15",
      "level": "Basic",
      "video": 4,
      "reading": 2,
      "time": "2 hours",
      "content": "Trong khóa này, JOBA sẽ hướng dẫn cho bạn cách xây dựng giao diện web responsive với Grid System, tương tự với Bootstrap 4."
    },
    "tutorial": [
      {
        "session": "1. Bắt đầu",
        "tutorialName": "Responsive là gì? ",
        "duration": "20 mins",
        "video": {
          "url": "https://www.youtube.com/embed/uz5LIP85J5Y?si=JehPsTKfBaZ_zIsh",
          "date": "2023-10-16",
          "description": "Responsive là một khái niệm trong thiết kế và phát triển trang web, nó đề cập đến khả năng của một trang web hoặc ứng dụng web thích nghi với các kích thước màn hình khác nhau và các thiết bị đa dạng. Mục tiêu của thiết kế responsive là đảm bảo rằng trang web sẽ hiển thị và hoạt động tốt trên cả máy tính, máy tính bảng và điện thoại di động, cũng như trên các loại màn hình khác. ",
          "operation": "Thiết kế responsive giúp đảm bảo rằng người dùng có trải nghiệm tốt trên mọi loại thiết bị và kích thước màn hình khác nhau, đồng thời cải thiện tối ưu hóa cho công cụ tìm kiếm (SEO) và tạo ra trải nghiệm người dùng thân thiện hơn. "
        }
      },
      {
        "tutorialName": "Chúng ta sẽ làm gì?",
        "duration": " 65 mins",
        "video": {
          "url": "https://www.youtube.com/embed/5QT0aeovTTY?si=Y2_sjYZgfJEW3CJv",
          "date": "2023-10-16",
          "description": ""
        }
      },

      {
        "session": "2 .Viewport, @media, breakpoint",
        "tutorialName": "Khái niệm Viewport",
        "duration": "20 mins",

        "video": {
          "url": "https://www.youtube.com/embed/XJiq_d0vGCQ?si=dkkkWzQyFJwUtlhF",
          "date": "2023-02-07",
          "description": "Viewport là gì? Viewport tạm dịch là khung nhìn, là khu vực có thể nhìn thấy của người dùng về nội dung trong một trang web. Viewport sẽ khác nhau với các thiết bị khác nhau, và sẽ nhỏ hơn trên điện thoại di động so với trên màn hình máy tính. "
        }
      },
      {
        "tutorialName": "Media query (@media)",
        "duration": "20 mins",
        "video": {
          "url": "https://www.youtube.com/embed/YgkzJkmDP3U?si=k9JrH3rGUe5P4Mpl",
          "date": "2023-02-13",
          "description": "Media query (truy vấn phương tiện) là một công cụ quan trọng trong thiết kế responsive web, cho phép bạn áp dụng các quy tắc CSS cụ thể dựa trên các đặc điểm của thiết bị và kích thước màn hình. Media query giúp điều chỉnh cách một trang web hiển thị trên các thiết bị và màn hình khác nhau.",
          "operation": "Bạn định nghĩa một điều kiện dựa trên các đặc điểm như chiều rộng màn hình, tỷ lệ khung hình, độ phân giải, và hướng màn hình, sau đó chỉ định các quy tắc CSS mà bạn muốn áp dụng khi điều kiện đó đúng."
        }
      },

      {
        "session": "3. Grid System",
        "tutorialName": "Khái niệm Breakpoints?",
        "duration": "10 mins",
        "video": {
          "url": "https://www.youtube.com/embed/0i37IU0wjlI?si=7cWLNXWqCunH0wUZ",
          "date": "2023-02-10",
          "description": "Breakpoints là các điểm dừng trong thiết kế responsive web, thường được xác định bằng sự thay đổi của đặc điểm như chiều rộng màn hình, độ phân giải, hoặc tỷ lệ khung hình. Breakpoints được sử dụng để định rõ các kích thước màn hình hoặc thiết bị cụ thể mà trang web sẽ thay đổi cách hiển thị của nó để tối ưu hóa trải nghiệm người dùng.",
          "operation": "Thông qua việc sử dụng media queries trong CSS, bạn có thể xác định các breakpoints và thiết lập quy tắc CSS tương ứng cho mỗi breakpoint. Khi màn hình trình duyệt của người dùng rơi vào một trong các phạm vi kích thước được xác định, trang web sẽ thay đổi tự động để phù hợp với kích thước đó, cung cấp trải nghiệm người dùng tốt hơn."
        }
      },
      {
        "tutorialName": "Hệ thống lưới (Grid system) ",
        "duration": "19 mins",
        "video": {
          "url": "https://www.youtube.com/embed/lvD5K50TZPk?si=cWsghm0lgchs9dJu",
          "date": "2023-02-10",
          "description": "Hệ thống lưới (Grid system) là một phần quan trọng trong thiết kế web và đồ họa, cho phép bạn cắt và sắp xếp các phần tử trên trang web hoặc bố cục bằng cách sử dụng các hàng và cột ảo để tạo cấu trúc trang. Hệ thống lưới giúp tạo ra trang web và bố cục được tổ chức gọn gàng, đồng nhất và dễ quản lý. Các lợi ích của việc sử dụng hệ thống lưới bao gồm:",
          "operation": "Có nhiều hệ thống lưới khác nhau mà bạn có thể sử dụng trong thiết kế web, bao gồm hệ thống lưới dựa trên các framework như Bootstrap, Foundation, hoặc hệ thống lưới tự tạo dựa trên CSS hoặc CSS preprocessor (như SASS hoặc LESS). Hệ thống lưới cung cấp các lớp CSS hoặc các thuộc tính để bạn có thể áp dụng chúng vào các phần tử HTML để tạo lên cấu trúc lưới dựa trên hàng và cột.",
          "advantage": "Tổ chức cấu trúc",
          "advantage1": "Responsive Design",
          "advantag2": "Cân bằng và Hài hòa",
          "advantage3": "Tính đồng nhất"
        }
      },

      {
        "session": "4. Áp dụng thực tế",
        "duration": "1 hour",
        "tutorialName": "Tạo thư viện? ",
        "video": {
          "url": "https://www.youtube.com/embed/lJworR_9WRk?si=BUTl8F2BrbBtaK9z",
          "date": "2023-02-10"
        }
      },
      {
        "duration": "13 mins 50s",
        "tutorialName": "Tạo đối tượng Grid ",
        "video": {
          "url": "https://www.youtube.com/embed/SZXvXXb_7aA?si=-1xIAc_A6_af7nvl",
          "date": "2023-02-10"
        }
      }
    ],
    "access": "120.312k",
    "trailer": "https://files.fullstack.edu.vn/f8-prod/courses/3.png"
  },
  {
    "courseName": {
      "name": "Lập trình C++ cơ bản",
      "date": "2023-10-15",
      "level": "Hard",
      "video": 4,
      "reading": 2,
      "time": "2 hours",
      "content": "Mục tiêu của khóa học này nhằm giúp các bạn nắm được các khái niệm căn cơ của lập trình, giúp các bạn có nền tảng vững chắc để chinh phục con đường trở thành một lập trình viên."
    },
    "tutorial": [
      {
        "session": "1 . Giới thiệu ",
        "tutorialName": "Giới thiệu khóa học ",
        "video": {
          "url": "https://www.youtube.com/embed/Da1tpV9TMU0?si=EdKmbjhjkcw6HS9m",
          "date": "2023-10-16",
          "description": "Nó là một ngôn ngữ bậc trung, kết hợp các tính năng của ngôn ngữ bậc cao và bậc thấp. C++ là một ngôn ngữ đa dụng, được sử dụng để phát triển nhiều loại ứng dụng khác nhau, bao gồm hệ điều hành, ứng dụng máy tính để bàn, ứng dụng di động, trò chơi điện tử, phần mềm kỹ thuật và khoa học. ",
          "operation": "C++ là một ngôn ngữ lập trình mạnh mẽ và linh hoạt, hỗ trợ lập trình hướng đối tượng, một mô hình lập trình dựa trên các đối tượng. Điều này giúp lập trình viên tổ chức mã một cách hiệu quả hơn và dễ bảo trì hơn.          ",
          "advantage": "Giúp chúng ta có thể làm việc trên bất kì một máy tính nào có hỗ trợ giao thức truyền thông.",
          "advantage1": "Hiệu suất cao",
          "advantage2": "Định hướng đối tượng",
          "advantage3": "Tính đa năng",
          "disadvantage": "Không thân thiện với người dùng: C++ không phải là một ngôn ngữ thân thiện với người dùng như các ngôn ngữ lập trình cấp cao khác.",
          "disadvantage1": "Có thể gây lỗi: C++ cho phép lập trình viên truy cập và kiểm soát bộ nhớ hệ thống trực tiếp, điều này có thể làm tăng nguy cơ lỗi."
        }
      },
      {
        "tutorialName": "Hướng dẫn cài đặt và sử dụng Dev - C++",
        "video": {
          "url": "https://www.youtube.com/embed/vFhKEYRBmVY?si=DTijO94dUsNQESOp",
          "date": "2023-02-07",
          "description": "là một môi trường phát triển tích hợp (IDE) miễn phí và mã nguồn mở được sử dụng để lập trình trong C và C++. Nó được phát triển bởi Colin Laplace và được phát hành lần đầu tiên vào năm 1998.",
          "advantage": "Trình soạn thảo mã tích hợp với hỗ trợ cú pháp và hoàn thành mã",
          "advantage1": "Trình biên dịch tích hợp dựa trên GCC",
          "advantage2": "Trình gỡ lỗi tích hợp",
          "advantage3": "Hỗ trợ cho các thư viện và tiện ích bổ sung của bên thứ ba"
        }
      },

      {
        "session": "2 .Biến và kiểu dữ liệu",
        "tutorialName": "Biến và nhập dữ liệu",
        "video": {
          "url": "https://www.youtube.com/embed/vFhKEYRBmVY?si=DTijO94dUsNQESOp",
          "date": "2023-02-07",
          "description": "Biến và nhập xuất dữ liệu là hai khái niệm cơ bản trong lập trình C++. Biến được sử dụng để lưu trữ dữ liệu, trong khi nhập xuất dữ liệu được sử dụng để giao tiếp với người dùng và thế giới bên ngoài."
        }
      },

      {
        "tutorialName": "Toán tử gán và toán tử số học - Toán tử quan hệ và logic",
        "video": {
          "url": "https://www.youtube.com/embed/THAJMtm53ZQ?si=PoLguDi3VZfcgo_6",
          "date": "2023-02-09",
          "description": "Toán tử gán được sử dụng để gán giá trị cho biến. Trong hầu hết các ngôn ngữ lập trình, toán tử gán thường là dấu =. Nó có nhiệm vụ gán giá trị bên phải của biểu thức cho biến bên trái của nó. Toán tử số học được sử dụng để thực hiện các phép tính số học trên các giá trị số.  "
        }
      },

      {
        "session": "3 .Cấu trúc điều khiển và vòng lặp",
        "tutorialName": "Cấu trức if else và vòng lặp",
        "video": {
          "url": "https://www.youtube.com/embed/1ppDCzoB03k?si=ii9GolK_ZvsM3KBM",
          "date": "2023-02-10",
          "description": "Cấu trúc If Else là một cấu trúc điều khiển cơ bản được sử dụng trong nhiều ngôn ngữ lập trình, bao gồm C++. Cấu trúc này cho phép lập trình viên kiểm tra một điều kiện và thực thi một hành động nếu điều kiện đó là đúng, hoặc thực thi một hành động khác nếu điều kiện đó là sai."
        }
      },
      {
        "tutorialName": "Toán tử 3 ngôi ",
        "video": {
          "url": "https://www.youtube.com/embed/YKeKmpcMcQY?si=6RZaGLfbviU9EbYh",
          "date": "2023-02-10",
          "description": "hay còn gọi là toán tử điều kiện trong C++, là một toán tử được cấu tạo bởi ba đối số gồm biểu thức điều kiện, kết quả khi điều kiện đúng và kết quả khi điều kiện sai. Kết quả ở đây có thể là một giá trị được trả về, cũng có thể là một xử lý sẽ thực hiện sau đó tùy thuộc vào điều kiện chỉ định là đúng hay sai."
        }
      },
      {
        "session": "4 .Làm việc với file",
        "tutorialName": "Làm việc với file text ",
        "video": {
          "url": "https://www.youtube.com/embed/LekUWlASyMY?si=t5jRdQT2HSlf6rcB",
          "date": "2023-02-25",
          "description": " liệu thường sẽ được sinh ra sẵn và đặt trong một file text nào đó. Nhiệm vụ của người làm bài là nhận dữ liệu từ file text đó, thiết kế thuật toán sau đó đưa kết quả ra một file text tương đương (hoặc vẫn đưa kết quả ra cửa sổ thực thi - tùy vào yêu cầu bài toán). Rất may mắn là ngôn ngữ C/C++ cung cấp những cú pháp rất đơn giản để thực hiện nhập - xuất dữ liệu bằng file. "
        }
      },
      {
        "tutorialName": "Làm việc với file nhận phân ",
        "video": {
          "url": "https://www.youtube.com/embed/UvNdzdhkDJQ?si=zqvBU9IGWSGASSAF",
          "date": "2023-02-27",
          "description": "File nhị phân là file chứa nội dung không nhất thiết phải là ASCII text"
        }
      }
    ],
    "access": "120.312k",
    "trailer": "../../assets/img/z4778395343762_8ae9ee2fdeffcc357337d1479d674175.jpg"
  },
  {
    "courseName": {
      "name": "HTML CSS từ Zero đến Hero",
      "date": "2023-10-15",
      "level": "Basic",
      "video": 4,
      "reading": 2,
      "time": "2 hours",
      "content": "Đây được xem là bước đầu cho các kỹ năng xây dựng trang web với ngôn ngữ HTML, CSS. Kết thúc khoá học, các bạn có thể tạo được trang web cơ bản. "
    },
    "tutorial": [
      {
        "session": "1. Bắt đầu",
        "tutorialName": "Tìm hiều về HTML và CSS",
        "video": {
          "url": "https://www.youtube.com/embed/zwsPND378OQ?si=kIPuoobw1GX8AEP4",
          "date": "2023-02-07",
          "description": "HTML (Hypertext Markup Language) và CSS (Cascading Style Sheets) là hai ngôn ngữ cơ bản trong phát triển trang web. Chúng thường được sử dụng cùng nhau để tạo và trình bày trang web.",
          "operation": "HTML và CSS thường là hai phần quan trọng của bất kỳ dự án phát triển trang web nào và cung cấp cơ sở cho việc hiển thị nội dung trên mạng."
        }
      },
      {
        "tutorialName": "Sử dụng CSS cơ bản trong HTML",
        "video": {
          "url": "https://www.youtube.com/embed/NsSsJTg29oE?si=Yld4064_cDHtZnuc",
          "date": "2023-02-09",
          "description": "CSS là một ngôn ngữ định kiểu được sử dụng để định dạng nội dung HTML. CSS có thể được sử dụng để thay đổi màu sắc, kích thước, vị trí và các thuộc tính khác của các phần tử HTML."
        }
      },
      {
        "session": "2. Làm quen với HTML",
        "tutorialName": "Cấu trúc của 1 file HTML ",
        "video": {
          "url": "https://www.youtube.com/embed/LYnrFSGLCl8?si=jVSHmpBwtvRPIISZ",
          "date": "2023-10-16",
          "description": "File HTML là một tập tin văn bản, trong đó các thẻ HTML được sử dụng để hiển thị nội dung trang web.",
          "operation": "Cấu trúc file HTML là một phần quan trọng của lập trình web. Bằng cách hiểu cấu trúc file HTML, bạn có thể tạo các trang web đẹp và hấp dẫn."
        }
      },

      {
        "tutorialName": "Các thẻ HTML thông dụng",
        "video": {
          "url": "https://www.youtube.com/embed/AzmdwZ6e_aM?si=_yd3KHOWGJb46anB",
          "date": "2023-10-16",
          "description": "Các thẻ HTML được sử dụng để hiển thị nội dung trang web. Mỗi thẻ HTML có hai phần: thẻ mở và thẻ đóng. Thẻ mở bắt đầu một phần tử HTML, trong khi thẻ đóng kết thúc phần tử HTML đó.",
          "operation": "Ví dụ, thẻ <p> được sử dụng để hiển thị một đoạn văn bản. Thẻ mở <p> bắt đầu một đoạn văn bản, trong khi thẻ đóng </p> kết thúc đoạn văn bản đó."
        }
      },

      {
        "session": "3. Làm quen với CSS",
        "tutorialName": "ID và Class",
        "video": {
          "url": "https://youtu.be/4J6d8cr0X48?si=aym4IM04JT0Ksu8V",
          "date": "2023-02-07",
          "description": "dhdhhdf"
        }
      },
      {
        "tutorialName": "CSS selectors cơ bản",
        "video": {
          "url": "https://www.youtube.com/embed/hzn_VKpGdTg?si=UEkWVyZz567qtun8",
          "date": "2023-02-09",
          "description": "CSS selectors (bộ chọn CSS) là các quy tắc được sử dụng để xác định các phần tử HTML mà bạn muốn áp dụng các quy tắc CSS."
        }
      },
      {
        "session": "4. Một số tricks và tips",
        "tutorialName": "Các cách căn giữa trong CSS",
        "video": {
          "url": "https://youtu.be/I2-m_kWZp_Y?si=Lr3tzTA_UIQ_MAxW",
          "date": "2023-02-13",
          "description": "dhdhhdf"
        }
      },
      {
        "tutorialName": "Hiển thị ảnh dự phòng khi ảnh chính lỗi",
        "video": {
          "url": "https://www.youtube.com/embed/ycb6ZDgX224?si=Jl-4qwrxsq-86Nas",
          "date": "2023-02-10",
          "description": "Hiển thị ảnh dự phòng là một kỹ thuật hữu ích để đảm bảo rằng người dùng luôn có thể xem hình ảnh trên trang web của bạn. Bằng cách sử dụng một trong hai phương pháp được đề cập ở trong bài này, bạn có thể đảm bảo rằng người dùng luôn có thể xem hình ảnh, ngay cả khi hình ảnh chính không tải được."
        }
      }
    ],
    "access": "120.312k",
    "trailer": "src/assets/img/z4778395342877_5752a242307c93528c8d7027838e9b54.jpg"
  },

  {
    "courseName": {
      "name": "Javascript cơ bản",
      "date": "2023-10-18",
      "content": "Course content for Kiến Thức Nhập Môn IT 2."
    },
    "access": "95.732k",
    "trailer": "src/assets/img/z4778395342876_1a68bb10f2b4ec1d34623b0f6f25c9c3.jpg"
  },
  {
    "courseName": {
      "name": "ReactJS",
      "date": "2023-10-18",
      "content": "Course content for Kiến Thức Nhập Môn IT 2."
    },
    "access": "95.732k",
    "trailer": "src/assets/img/z4778395331088_8a3a042c4e8ade60c543fd1b9674c79c.jpg"
  },
  {
    "courseName": {
      "name": " Ubuntu",
      "date": "2023-10-18",
      "content": "Course content for Kiến Thức Nhập Môn IT 2."
    },
    "access": "95.732k",
    "trailer": "src/assets/img/z4778395338780_bb863178799bbbfaf32f79de2849ff20.jpg"
  }
  
]
